src/DataProcessors/ПечатьСтикеровДляКоробок/ПечатьСтикеровДляКоробок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьСтикеровДляКоробок</name>
  <tabularSections>
    <name>Коробки</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>CatalogRef.ХранилищеШаблонов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/ПечатьСтикеровДляКоробок/ObjectModule.bsl
Процедура ЗаполнитьКоробки(Масс) Экспорт 
	шаблон=Константы.ШаблонПечатиГрупповыхСтикеров.Получить();
	Для каждого стр из масс Цикл
		новаякоробка=Коробки.Добавить();
		новаякоробка.Количество=1;
		новаякоробка.Ссылка=стр;
		новаякоробка.Шаблон=шаблон;
		новаякоробка.Штрихкод = стр.Штрихкод;
	КонецЦикла;
КонецПроцедуры
